In [1]:
import pandas as pd
import numpy as np

In [2]:
movies_df=pd.read_table('data/movies.dat','::',names=['title','genre'],index_col=0,engine='python')
ratings_df=pd.read_table('data/ratings.dat','::',names=['UserID','MovieID','rating','timestamp'],engine='python')
users_df=pd.read_table('data/users.dat','::',names=['gender','age','occupation','zip'],index_col=0,engine='python')

In [3]:
movies_df

                                   title                         genre
1                       Toy Story (1995)   Animation|Children's|Comedy
2                         Jumanji (1995)  Adventure|Children's|Fantasy
3                Grumpier Old Men (1995)                Comedy|Romance
4               Waiting to Exhale (1995)                  Comedy|Drama
5     Father of the Bride Part II (1995)                        Comedy
...                                  ...                           ...
3948             Meet the Parents (2000)                        Comedy
3949          Requiem for a Dream (2000)                         Drama
3950                    Tigerland (2000)                         Drama
3951             Two Family House (2000)                         Drama
3952               Contender, The (2000)                Drama|Thriller

[3883 rows x 2 columns]

In [144]:
books_df=pd.read_csv('data/BX-Books.csv','\";\"',index_col=0,engine='python')

cols=books_df.columns.tolist()

cols[-1]='Image-URL-L'

books_df.columns=cols

books_df.index=[elem[1:] for elem in books_df.index]

books_df['Image-URL-L']=[elem[:-1] for elem in books_df['Image-URL-L']]

books_df.index.name='ISBN'

book_ratings_df=pd.read_csv('data/BX-Book-Ratings.csv','\";\"',index_col=0,engine='python')

book_ratings_df.columns=['ISBN','Book-Rating']

book_ratings_df.index=[int(elem[1:]) for elem in book_ratings_df.index]

book_ratings_df['Book-Rating']=[int(elem[:-1]) for elem in book_ratings_df['Book-Rating']]

book_ratings_df.index.name='User-ID'

book_users_df=pd.read_csv('data/BX-Users.csv','\";',index_col=0,engine='python')

book_users_df.index=[int(elem[1:]) for elem in book_users_df.index]

book_users_df.index.name='User-ID'

book_users_df.columns=['Location','Age']

book_users_df['Location']=[elem[1:] for elem in book_users_df['Location']]

book_users_df['Age'].iloc[0] is np.nan

book_users_df['Age']=[elem[1:-1] if elem is not np.nan else np.nan for elem in book_users_df['Age']]

In [137]:
movies_df.describe()

                                 title  genre
count                             3883   3883
unique                            3883    301
top     Simple Twist of Fate, A (1994)  Drama
freq                                 1    843

In [146]:
book_ratings_df.describe()

        Book-Rating
count  1.149780e+06
mean   2.866950e+00
std    3.854184e+00
min    0.000000e+00
25%    0.000000e+00
50%    0.000000e+00
75%    7.000000e+00
max    1.000000e+01

In [31]:
movies_df['year']=movies_df.title.str[-5:-1].astype(int)

In [34]:
movies_df.year

1       1995
2       1995
3       1995
4       1995
5       1995
        ...
3948    2000
3949    2000
3950    2000
3951    2000
3952    2000
Name: year, Length: 3883, dtype: int64

In [39]:
movies_df['tt']=movies_df.title.str[:-7]

In [42]:
movies_df.drop('title',1)

                             genre  year                           tt
1      Animation|Children's|Comedy  1995                    Toy Story
2     Adventure|Children's|Fantasy  1995                      Jumanji
3                   Comedy|Romance  1995             Grumpier Old Men
4                     Comedy|Drama  1995            Waiting to Exhale
5                           Comedy  1995  Father of the Bride Part II
...                            ...   ...                          ...
3948                        Comedy  2000             Meet the Parents
3949                         Drama  2000          Requiem for a Dream
3950                         Drama  2000                    Tigerland
3951                         Drama  2000             Two Family House
3952                Drama|Thriller  2000               Contender, The

[3883 rows x 3 columns]

In [21]:
from data_models import Movie